In [1]:
# 1 Ans. 
# 'read_csv()`: Load data from a CSV file.
# `fillna()`: Replace missing values in a DataFrame.
# `mean()`: Calculate the mean of a Series or DataFrame.
# `std()`: Calculate the standard deviation of a Series or DataFrame.
# `describe()`: Calculate summary statistics for a Series or DataFrame.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [4]:
df=pd.read_excel("Book5.xlsx")

In [6]:
df.reindex()

   Unnamed: 0         A          B           C
0           1      Name      Place      Number
1           2  Bakhtiar    Kolkata  9123611241
2           3     Altaf  Hyderabad  8443077651
3           4      Ajaz    chennai  7894561231
4           5      Saif     Ranchi  7418529637

In [10]:
std_data=[(15,"Varun",30,"male","Chandigarh"),(20,"Bakhtiar",30,"male","Kolkata"),(25,"Rabia",22,"Female","Hyderabad")]

In [11]:
df=pd.DataFrame(std_data,columns=["Values","Name","Age","Gender","address"])

In [12]:
df

   Values      Name  Age  Gender     address
0      15     Varun   30    male  Chandigarh
1      20  Bakhtiar   30    male     Kolkata
2      25     Rabia   22  Female   Hyderabad

In [13]:
df["Values"][0:3].sum()

60

In [14]:
data=[("Cat","Kolkata",9123611241),("dog","Goa",8546114778)]

In [15]:
df1=pd.DataFrame(data,columns=["Text","Place","Number"])

In [15]:
df1

  Text    Place      Number
0  Cat  Kolkata  9123611241
1  dog      Goa  8546114778

In [27]:
df1["Word_count"]=len(df1["Text"])

In [28]:
df1

  Text    Place      Number  Word_count
0  Cat  Kolkata  9123611241           2
1  dog      Goa  8546114778           2

In [29]:
# 5. Ans 

# DataFrame.shape
# Return a tuple representing the dimensionality of the DataFrame.

# DataFrame.size
# Return an int representing the number of elements in this object.

In [18]:
df2=pd.read_excel("Book5.xlsx")

In [19]:
data1={"email":["bahti@domain.com","altaf@domain.com","rabia@domain.com"],
      "Number":[78946,85214,963258]
      }

In [20]:
df3=pd.DataFrame(data1)

In [25]:
df3["username"]=df3["email"]

In [24]:
df3

              email  Number          username
0  bahti@domain.com   78946  bahti@domain.com
1  altaf@domain.com   85214  altaf@domain.com
2  rabia@domain.com  963258  rabia@domain.com

In [28]:
stats=[(0, 3, 5), (1,
1, 8), (2, 7,
2), (6, 9, 4),
(3, 2, 3), (5,
4, 9), (1, 2,8)]

In [30]:
df=pd.DataFrame(stats,columns=["A","B","C"])

In [33]:
df[df["A"]>5]

   A  B  C
3  6  9  4

In [35]:
df[df["B"]<10]

   A  B  C
0  0  3  5
1  1  1  8
2  2  7  2
3  6  9  4
4  3  2  3
5  5  4  9
6  1  2  8

In [38]:
df5=df[df["A"]>5] + df[df["B"]<10]

In [39]:
df5

      A     B    C
0   NaN   NaN  NaN
1   NaN   NaN  NaN
2   NaN   NaN  NaN
3  12.0  18.0  8.0
4   NaN   NaN  NaN
5   NaN   NaN  NaN
6   NaN   NaN  NaN

In [40]:
df=pd.DataFrame(std_data,columns=["Values","Name","Age","Gender","address"])

In [41]:
df

   Values      Name  Age  Gender     address
0      15     Varun   30    male  Chandigarh
1      20  Bakhtiar   30    male     Kolkata
2      25     Rabia   22  Female   Hyderabad

In [42]:
df["Values"].mean()

20.0

In [43]:
df["Values"].median()

20.0

In [49]:
day={"Date":["2023-01-01",
 "2023-01-02",
 "2023-01-03",
 "2023-01-04",
 "2023-01-05"]}

In [50]:
df10=pd.DataFrame(day)

In [55]:
df10["Weekdays"]=["Sunday","Monday","Tuesday","Wednesday","Thursday"]

In [56]:
df10

         Date   Weekdays
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [3]:
input=[(14500,"12/6/24"),(2500,"12/03/24"),(8500,"15/03/24")]

In [4]:
df11=pd.DataFrame(input,columns=["Sales","Dates"])

In [5]:
df11

   Sales     Dates
0  14500   12/6/24
1   2500  12/03/24
2   8500  15/03/24

In [9]:
df11["Moving_Sales"]=df11["Sales"].mean()

In [7]:
df11

   Sales     Dates  Moving_Sales
0  14500   12/6/24        8500.0
1   2500  12/03/24        8500.0
2   8500  15/03/24        8500.0